[GraphicalObject]
Name=hpsqst
Path=
Caption="ハイパーシーケンス ステータス"
WndStyle=BORDER|CAPTION
PosStyle=FLOATABLE
X=280
Y=10
Width=233
Height=246
FrameThickness=1
Activate=0
zorder=1
EraseBk=1
Set0=
rc-dll=hpsam008.dll


[ToolDescriptor]
1=sequence_st,static,hpgwct02.dll
2=barcode_st,static,hpgwct02.dll
3=sequence,static,hpgwct02.dll
4=barcode,static,hpgwct02.dll
5=platetype,static,hpgwct02.dll
6=platetype_st,static,hpgwct02.dll
7=hyperseq,static,hpgwct02.dll
8=hyperseq_st,static,hpgwct02.dll
9=description,static,hpgwct02.dll
10=description_st,static,hpgwct02.dll
11=stop_bt,pushbutton,hpgbut02.dll
12=hyper_run_st,statuslist,hpgwct02.dll

[fontalias]
1=normal|ＭＳ Ｐゴシック,9,normal
2=bold|ＭＳ Ｐゴシック,9,bold
3=boldplus|ＭＳ Ｐゴシック,9,Bold

[coloralias]
1=white|255,255,255
2=black|0,0,0
3=yellow|255,255,0
4=gray|192,192,192
5=red|255,0,0
6=green|0,255,0
7=blue|0,0,255

[static hyperseq]
x=5
y=8
width=63
height=20
shiftx=0
shifty=2
dimage=4
justify=left
Multiline=0

text1="ハイパーシーケンス:"
Help="ハイパーシーケンス"
Font=bold
TEXTColor=black
BKColor=gray


[static hyperseq_st]
x=69
y=8
width=157
height=20
shiftx=0
shifty=2
dimage=4
framethickness=0
justify=left
Multiline=0

text1=""
Help="ハイパーシーケンス"
Font=bold
TEXTColor=black
BKColor=gray


[static sequence]
x=5
y=72
width=70
height=20
shiftx=0
shifty=2
dimage=4
justify=left
Multiline=0

text1="シーケンス"
Help="シーケンス"
Font=bold
TEXTColor=black
BKColor=gray

[static sequence_st]
x=76
y=72
width=141
height=20
shiftx=0
shifty=2
dimage=4
framethickness=1
justify=left
Multiline=0

text1="シーケンスなし"
Help="シーケンス実行中の名前"
Font=bold
TEXTColor=black
BKColor=gray

[static barcode]
x=5
y=100
width=70
height=20
shiftx=0
shifty=2
dimage=4
justify=left
Multiline=0

text1="バーコード"
Help="バーコード"
Font=bold
TEXTColor=black
BKColor=gray

[static barcode_st]
x=76
y=100
width=141
height=20
shiftx=0
shifty=2
dimage=4
framethickness=1
justify=left
Multiline=0

text1="バーコードなし"
Help="バーコード"
Font=bold
TEXTColor=black
BKColor=gray

[static platetype]
x=5
y=128
width=70
height=20
shiftx=0
shifty=2
dimage=4
justify=left
Multiline=0

text1="プレート タイプ"
Help="プレート タイプ"
Font=bold
TEXTColor=black
BKColor=gray

[static platetype_st]
x=76
y=128
width=141
height=20
shiftx=0
shifty=2
dimage=4
framethickness=1
justify=left
Multiline=0

text1="プレート タイプなし"
Help="プレート タイプ"
Font=bold
TEXTColor=black
BKColor=gray

[static description]
x=5
y=156
width=70
height=20
shiftx=0
shifty=2
dimage=4
justify=left
Multiline=0

text1="説明"
Help="説明"
Font=bold
TEXTColor=black
BKColor=gray

[static description_st]
x=76
y=156
width=141
height=20
shiftx=0
shifty=2
dimage=4
framethickness=1
justify=left
Multiline=0

text1="説明なし"
Help="説明"
Font=bold
TEXTColor=black
BKColor=gray

[PushButton stop_bt]
x=5
y=184
height=26
width=216
enable=0
command = CpRequest CPGUI,"Hyper_Stop"
ImageList=ストップ|ストップ|ストップ
font=ＭＳ Ｐゴシック,10,Bold
color=gray

TextColor=255,0,0
BKColor=gray


[statuslist hyper_run_st]
enable=1
x=5
y=37
width=216
height=29
bkcolor=gray
font=boldplus
frame=1
Help=スタックのステータスを表示します
RcDll=hpsam008.dll
RcDll1=hpsam008.dll

Symbols1=red|blue|green|gray|yellow


red = RBMP.HYPRED
blue = RBMP.HYPBLUE
green = RBMP.HYPGREEN
yellow = RBMP.HYPYELLOW
gray = RBMP.HYPGRAY


ready = Ready
offline = Offline
running = Running
error = Error

Elements=green|ready


ImageStart=1
ElementStart=1
ElementEnd=2

Image1=green
x1=0
y1=0
ROP1=SRCCOPY

Image2=Text1
x2=105
y2=15
justify2 = centered
Font2=bold







